In [1]:
import numpy as np
import pandas as pd

In [36]:
df= pd.DataFrame({"c1":[2,3,4,4,6],
                 "c2":[17,71,97,41,108],
                "c3":["x","y","z","d","j"]})

In [37]:
df

   c1   c2 c3
0   2   17  x
1   3   71  y
2   4   97  z
3   4   41  d
4   6  108  j

In [38]:
df.head()     #default

   c1   c2 c3
0   2   17  x
1   3   71  y
2   4   97  z
3   4   41  d
4   6  108  j

In [39]:
df.head(n=3)

   c1  c2 c3
0   2  17  x
1   3  71  y
2   4  97  z

In [40]:
df["c1"].unique()

array([2, 3, 4, 6], dtype=int64)

In [41]:
df["c1"].nunique()

4

In [42]:
df["c1"].value_counts()

4    2
6    1
3    1
2    1
Name: c1, dtype: int64

In [43]:
df

   c1   c2 c3
0   2   17  x
1   3   71  y
2   4   97  z
3   4   41  d
4   6  108  j

In [44]:
df[(df["c1"]>=3) & (df["c2"]<=71)]

   c1  c2 c3
1   3  71  y
3   4  41  d

In [45]:
df

   c1   c2 c3
0   2   17  x
1   3   71  y
2   4   97  z
3   4   41  d
4   6  108  j

In [46]:
def times(x):
    return x*7

In [47]:
df["c1"]=df["c1"].apply(times)

In [48]:
df

   c1   c2 c3
0  14   17  x
1  21   71  y
2  28   97  z
3  28   41  d
4  42  108  j

In [49]:
value = lambda x: x*2

In [50]:
value(17)

34

In [51]:
df["c1"].apply(lambda x:x*2)

0    28
1    42
2    56
3    56
4    84
Name: c1, dtype: int64

In [52]:
df["c3"].apply(len)

0    1
1    1
2    1
3    1
4    1
Name: c3, dtype: int64

In [53]:
df.drop("c3",axis =1,inplace=True)

In [54]:
df

   c1   c2
0  14   17
1  21   71
2  28   97
3  28   41
4  42  108

In [55]:
df.columns

Index(['c1', 'c2'], dtype='object')

In [56]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [57]:
len(df.index)

5

In [58]:
df.index.names

FrozenList([None])

In [59]:
df

   c1   c2
0  14   17
1  21   71
2  28   97
3  28   41
4  42  108

In [61]:
df.sort_values("c2")

   c1   c2
0  14   17
3  28   41
1  21   71
2  28   97
4  42  108

In [62]:
df.sort_values("c1",ascending=False)

   c1   c2
4  42  108
2  28   97
3  28   41
1  21   71
0  14   17

In [83]:
df =pd.DataFrame({
    "Months" :["January", "February", "December"," April", "May", "October", "July", "December", "September"," October"," November", "December"],
    "Cities":["Herning","Copenhagen","Helsingor","Sonderborg","Esbjerg"," Roskilde","Skagen","Frederiksberg","Aalborg","Roskilde ","Aarhus","Copenhagen"],
    "Tempature":[2,1,3,5,7,17,1,17,13,11,7,3]})

In [84]:
df

       Months         Cities  Tempature
0     January        Herning          2
1    February     Copenhagen          1
2    December      Helsingor          3
3       April     Sonderborg          5
4         May        Esbjerg          7
5     October       Roskilde         17
6        July         Skagen          1
7    December  Frederiksberg         17
8   September        Aalborg         13
9     October      Roskilde          11
10   November         Aarhus          7
11   December     Copenhagen          3

In [87]:
df.pivot_table(index="Months")

           Tempature
Months
 April      5.000000
 November   7.000000
 October   11.000000
December    7.666667
February    1.000000
January     2.000000
July        1.000000
May         7.000000
October    17.000000
September  13.000000

In [88]:
df.pivot_table(columns ="Cities")

Cities,Roskilde,Aalborg,Aarhus,Copenhagen,Esbjerg,Frederiksberg,Helsingor,Herning,Roskilde,Skagen,Sonderborg
Tempature,17,13,7,2,7,17,3,2,11,1,5

In [89]:
df

       Months         Cities  Tempature
0     January        Herning          2
1    February     Copenhagen          1
2    December      Helsingor          3
3       April     Sonderborg          5
4         May        Esbjerg          7
5     October       Roskilde         17
6        July         Skagen          1
7    December  Frederiksberg         17
8   September        Aalborg         13
9     October      Roskilde          11
10   November         Aarhus          7
11   December     Copenhagen          3

In [107]:
df.pivot(index="Cities",columns="Months",values="Tempature")

Months,April,November,October,December,February,January,July,May,October,September
Cities,,,,,,,,,,
Roskilde,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,17.0,NaN
Aalborg,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,13.0
Aarhus,NaN,7.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Copenhagen,NaN,NaN,NaN,3.0,1.0,NaN,NaN,NaN,NaN,NaN
Esbjerg,NaN,NaN,NaN,NaN,NaN,NaN,NaN,7.0,NaN,NaN
Frederiksberg,NaN,NaN,NaN,17.0,NaN,NaN,NaN,NaN,NaN,NaN
Helsingor,NaN,NaN,NaN,3.0,NaN,NaN,NaN,NaN,NaN,NaN
Herning,NaN,NaN,NaN,NaN,NaN,2.0,NaN,NaN,NaN,NaN
Roskilde,NaN,NaN,11.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Skagen,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,NaN,NaN
Sonderborg,5.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [108]:
stacked =df.stack()

In [97]:
stacked

0   Months             January
    Cities             Herning
    Tempature                2
1   Months            February
    Cities          Copenhagen
    Tempature                1
2   Months            December
    Cities           Helsingor
    Tempature                3
3   Months               April
    Cities          Sonderborg
    Tempature                5
4   Months                 May
    Cities             Esbjerg
    Tempature                7
5   Months             October
    Cities            Roskilde
    Tempature               17
6   Months                July
    Cities              Skagen
    Tempature                1
7   Months            December
    Cities       Frederiksberg
    Tempature               17
8   Months           September
    Cities             Aalborg
    Tempature               13
9   Months             October
    Cities           Roskilde
    Tempature               11
10  Months            November
    Cities              Aarhus
    Tempature                7
11  Months            December
    Cities          Copenhagen
    Tempature                3
dtype: object

In [109]:
stacked.unstack()

       Months         Cities Tempature
0     January        Herning         2
1    February     Copenhagen         1
2    December      Helsingor         3
3       April     Sonderborg         5
4         May        Esbjerg         7
5     October       Roskilde        17
6        July         Skagen         1
7    December  Frederiksberg        17
8   September        Aalborg        13
9     October      Roskilde         11
10   November         Aarhus         7
11   December     Copenhagen         3